Autodesk.Revit.DB.NumberingSchema.IsValidPartitionName(System.String,System.String@)
Tests if the given string can be used as a name for a numbering partition.
Remarks:
For a name to be considered valid it must contain only printable characters
excluding any characters that may not be used in name of a file.
name:
A name to validate.
message:
Optional string to receive an error message to possibly show to the
end user in case the name is found invalid. This argument may be null.
Returns:
Returns True if the name can be used; or False if the string contains invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.AssignElementsToSequence(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.String)
Assigns the input elements to a sequence identified by the given partition name.
Remarks:
Elements will be added to the sequence by changing the value of their
Partition parameter. The difference between this method and changing the
parameter value explicitly is that the method here causes sequences to get assigned
and renumbered automatically and immediately without needing to commit a transaction first.
A numbering sequence for the given partition does not need to exist yet;
it will get created automatically by this method as needed.
The elements' numbers are likely to be affected by this operation, which is to be
expected. The values of assigned numbers will depend on whether the given sequence
already exists or not. In both cases the elements will get renumbered in order of their
original creation, but the first value will be 1 if the sequence does not exist yet,
respectively the next highest number if the sequence does exist already. The general
matching policy is always applied causing matched elements to have the same number.
A special case is considered when the given elements are all the elements
of one sequence and are being assigned to a sequence that does not exist yet.
Such an operation is identical in effect to the MoveSequence
method and all the elements will keep their numbers unchanged.
elementIds:
Ids of elements which are to be added to a sequence.
All elements must be valid and belonging to this schema.
partitionName:
Name of the target sequence's partition
Throws Autodesk.Revit.Exceptions.ArgumentException:
the given partitionName cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
-or-
Thrown when elementIds contains Ids that are either invalid or of elements not from this schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.MergeSequences(System.Collections.Generic.IList{System.String},System.String)
Merges all elements from given numbering sequences to a new sequence.
Remarks:
Upon a successful merge, all elements in the new merged sequence
will be renumbered in order of the element creation. There will be no gaps.
There must not be a sequence for the target partition in the schema yet,
otherwise an exception will be thrown.
This operation modifies the Partition parameter of all elements
in the sequences that are being merged. Therefore, all its elements
must be accessible for editing, otherwise this operation will fail.
sourcePartitions:
A collection of partition names identifying the sequences to be merged together.
There must be at least two names in the list. All the sequences must exist already.
newPartition:
Name of a new partition into which the source sequences will be merged.
Leading and trailing white space is ignored in the given string and will be removed automatically.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sourcePartitions list must contain at least two names.
-or-
Either one or more sequences in the sourcePartitions list does
not exist in the schema, or the list contains duplicated names.
-or-
The sequence newPartition does already exist in the schema.
-or-
the given newPartition cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.AppendSequence(System.String,System.String)
Appends all elements of one numbering sequence to the end of another sequence.
Remarks:
All numbers assigned to elements in the target sequence remain the same,
but numbers in the source sequence (the one getting appended) will change.
Elements that match elements in the target sequence will get the same
numbers assigned. Remaining elements will get consecutive numbers in the
creation order of the elements starting with the next highest
number available in the target sequence.
This operation modifies the Partition parameter of all elements
in the sequence that is getting appended. Therefore, all its elements
must be accessible for editing, otherwise this operation will fail.
Elements can be appended only to a sequence that already exists. In order to
reassign elements of one sequence to a partition that does not exist yet,
use either the MoveSequence or
MergeSequences methods.
fromPartition:
Name of the partition that determines which numbering sequence to append.
The sequence must exist already, otherwise an exception will be thrown.
toPartition:
Name of a partition into which the source sequence is going to be appended.
The sequence must exist already, otherwise an exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence fromPartition does not exist in the schema.
-or-
The sequence toPartition does not exist in the schema.
-or-
Given partition names fromPartition and toPartition must be different.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.MoveSequence(System.String,System.String)
Moves all elements of a numbering sequence from one partition to another.
Remarks:
All numbers assigned to elements in the sequence remain the same.
This operation modifies the Partition parameter of all elements
in the given sequence. Therefore, all the elements must be accessible
for editing.
Elements can be moved only to a partition that does not exist yet. To move elements
to an existing partition use the AppendSequence method.
fromPartition:
Name of the partition that determines which numbering sequence to move.
The sequence must exist already, otherwise an exception will be thrown.
newPartition:
Name of a partition into which the source sequence is going to be moved.
The schema must not have a sequence for this partition yet
(i.e. the schema does not have an element that was assigned to such a partition.)
Leading and trailing white space is ignored in the given string and will be
removed automatically.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence fromPartition does not exist in the schema.
-or-
The sequence newPartition does already exist in the schema.
-or-
the given newPartition cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Thrown if there is an element that cannot have new value of the NUMBER_PARTITION_PARAM
parameter assigned. It may be an indication that the element is not free to be edited at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.ChangeNumber(System.String,System.Int32,System.Int32)
Replaces an existing number with a new one (that does not exist yet).
Remarks:
This method gives the caller the ability to overwrite any number used in a given
numbering sequence as long as the new number does not exist in the same sequence yet.
If an attempt is made to replace a number by another that already exists, an exception
will be thrown.
The new number will automatically be applied to all elements that bear the original
number, thus those elements must be free to be modified. A collection of element Ids
of all the affected elements is returned by this method.
The method is independent of the sequence's current starting number that might have
been assigned previously, meaning that the new number will be accepted even if it is
lower than the previously set start number in the sequence.
partition:
Name of the partition that identifies the sequence containing the number to be changed.
fromNumber:
Number to be changed; there must already be an element with that number in the sequence.
toNumber:
Number to change to; no element must have this number yet in the sequence.
Returns:
A collection of elements affected by the change of the number
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
-or-
The specified sequence does not contain any elements with the given fromNumber.
-or-
There already are elements with the given toNumber in the specified sequence.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value of toNumber must be in the range from 1 to the maximum value for an Integer type
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.ShiftNumbers(System.String,System.Int32)
Shifts all numbers in the sequence so the starting number has the given value.
Remarks:
A shift of all numbers in the sequence will be computed and applied
so the first (lowest) number in the sequence would have the given value.
All the other numbers will then be shifted relatively by the same amount.
Any existing gaps in the current numbering sequence will be preserved.
Shifts that would make the start number less than 1 or bigger than
Autodesk.Revit.DB.NumberingSchema.MaximumStartingNumber are considered invalid.
partition:
Name of the partition that identifies the sequence. The sequence must exist.
firstNumber:
Value for the new first (lowest) number of the sequence.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
firstNumber must be in range between 1 and MaximumStartingNumber.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.RemoveGaps(System.String)
Removes gaps, if any, in a numbering sequence
Remarks:
Gaps are removed by shifting numbers above each gap down by the amount of
numbers skipped in the gap. The lowest number in the sequence will remain unchanged.
partition:
Name of the partition that identifies the sequence. The sequence must exist.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetNumbers(System.String)
Returns all numbers currently used in the given numbering sequence
Remarks:
Numbers are returned as a collection of ranges, where each range
is a pair of two integer values, Low and High. As long as there is
no gap currently in the sequence, there will be only one range.
partition:
Name of the partition that identifies the sequence. The sequence must exist.
Returns:
A collection of integer ranges
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetMinimumNumberOfDigits(Autodesk.Revit.DB.Document,System.Int32)
Sets a new value for the minimum number of digits to be used for formating
the Number parameter of all numbered elements of the given document.
Remarks:
Valid values range from 1 to 10. Numbers with fewer digits
than the minimum number will be padded with leading zeros.
The value affects all numbering schemas. Thus, once set, numbers for
Rebar and Reinforcement Fabric will be formatted with the same minimum number of digits.
The current value can obtained by invoking the Autodesk.Revit.DB.NumberingSchema.GetMinimumNumberOfDigits(Autodesk.Revit.DB.Document) method.
document:
The document in which the new value will be in applied.
value:
New value for the minimum number of digits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The minimum number of digits must be in range from 1 to 10.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetMinimumNumberOfDigits(Autodesk.Revit.DB.Document)
Returns the minimum number of digits to be used for formating
the Number parameter of all enumerable elements of the given document.
Remarks:
The number is used by all numbering schemas in the document.
The value can be modified by using the Autodesk.Revit.DB.NumberingSchema.SetMinimumNumberOfDigits(Autodesk.Revit.DB.Document,System.Int32) method.
document:
The document this value is going to be applied to.
Returns:
The current number of formatting digits
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetNumberingSchema(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.NumberingSchemaType)
Returns an instance of the specified Numbering Schema in the given document.
document:
A document to get the numbering schema from.
schemaType:
The type of a built-in schema to get.
Returns:
Instance of the specified schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given schemaType has an invalid Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetSchemasInDocument(Autodesk.Revit.DB.Document)
Returns a set of Ids of all Numbering Schema elements for a given document.
document:
A document to get numbering schema from.
Returns:
Ids of NumberingSchema elements. An empty set if no schemas are found in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015